barrylw/lamp_project_slave/STM32F051_contiki_8M/APP/hal_radio.c
                            g_RF_LoRa.rf_DataBuffer[14]          = rn8209c_papameter.pwmValue ; /*pwm value*/

                            g_RF_LoRa.rf_DataBuffer[15]          = 0;
                            g_RF_LoRa.rf_DataBuffer[16]          = 0;
                            g_RF_LoRa.rf_DataBuffer[17]          = 0;         
                            g_RF_LoRa.rf_DataBuffer[18]          = 0; //worning
                            
                            //read_8209c_U();
                            g_RF_LoRa.rf_DataBuffer[19]          = (u8)(rn8209c_papameter.Uv & 0xFF);
                            g_RF_LoRa.rf_DataBuffer[20]          = (u8)((rn8209c_papameter.Uv >>8) & 0xFF); //voltage
                            
                            //read_8209c_Ia();
                            g_RF_LoRa.rf_DataBuffer[21]          = (u8)(rn8209c_papameter.Ia & 0xFF);
                            g_RF_LoRa.rf_DataBuffer[22]          = (u8)((rn8209c_papameter.Ia >>8) & 0xFF); 
                            g_RF_LoRa.rf_DataBuffer[23]          = (u8)((rn8209c_papameter.Ia >>16) & 0xFF);        
                            g_RF_LoRa.rf_DataBuffer[24]          = (u8)((rn8209c_papameter.Ia >>24) & 0xFF); //current
                            
                            //read_8209c_Pa();
                            g_RF_LoRa.rf_DataBuffer[25]          = (u8)(rn8209c_papameter.Pa & 0xFF); 
                            g_RF_LoRa.rf_DataBuffer[26]          = (u8)((rn8209c_papameter.Pa >>8) & 0xFF); //power
                            
                            g_RF_LoRa.rf_DataBuffer[27]          = read_pow_factor(); //功率因数
                            
                            g_RF_LoRa.rf_DataBuffer[28]          = 0; 
                            g_RF_LoRa.rf_DataBuffer[29]          = 0; //温度
                            
                            read_8209c_energyP();
                            g_RF_LoRa.rf_DataBuffer[30]          = 0;
                            g_RF_LoRa.rf_DataBuffer[31]          = 0;
                            g_RF_LoRa.rf_DataBuffer[32]          = 0;         
                            g_RF_LoRa.rf_DataBuffer[33]          = 0; //电量
                            
                            temp_light_time = get_light_time();
                            g_RF_LoRa.rf_DataBuffer[34]          = (u8)(temp_light_time & 0xFF);;
                            g_RF_LoRa.rf_DataBuffer[35]          = (u8)((temp_light_time >>8) & 0xFF);
                            g_RF_LoRa.rf_DataBuffer[36]          = (u8)((temp_light_time >>16) & 0xFF);          
                            g_RF_LoRa.rf_DataBuffer[37]          = (u8)((temp_light_time >>24) & 0xFF); //current //亮灯时长
                            
                            for (u16 i = 14; i <= 37; i++ )
                            {
                              g_RF_LoRa.rf_DataBuffer[i] += 0x33;
                            }
                            
                            g_RF_LoRa.rf_DataBuffer[38]           = getSum(g_RF_LoRa.rf_DataBuffer, 10 + g_RF_LoRa.rf_DataBuffer[DATA_LENGTH_645_POINT]); //cs
                            g_RF_LoRa.rf_DataBuffer[39]           = 0x16; //end
                            
                            MemCpy( &g_RF_LoRa.rf_DataBuffer[40], info_sourceadd,  6); //信息域
                      
                            MemCpy( &g_RF_LoRa.rf_DataBuffer[46], info_sourceadd + 12,  6); //信息域
                      
                            MemCpy( &g_RF_LoRa.rf_DataBuffer[52], info_sourceadd + 6,  6); //信息域
                            
                            SX1276LoRa_Send_Packet(g_RF_LoRa.rf_DataBuffer, g_RF_LoRa.rf_DataBuffer[DATA_LENGTH_645_POINT] + 12 + 18);
                        }
                     
                    }
                    
                  break;

                  default:
                    
                  break;
              }
          }
         
       }
     }
  }
  
}



/* 尽量将etimer 绑定在事件中，在事件中定义 */
PROCESS(hal_RF_process, "radio_process ");

#ifdef USE_LORA_MODE
PROCESS_THREAD(hal_RF_process, ev, data)
{
  PROCESS_BEGIN();
  
  while(1)
  {
    PROCESS_WAIT_EVENT(); 

    if (ev == PROCESS_EVENT_MSG)
    {
        if (*((tRFLRStates*)data) == RFLR_STATE_TX_RUNNING)   
        {
            etimer_set(&timer_rf, CLOCK_CONF_SECOND*2);               //超时时间还需要调整
            printf("tx start\r\n");
        }
        else if (*((tRFLRStates*)data) == RFLR_STATE_TX_DONE)  
        {
           //etimer_stop(&timer_rf);                                  //此处如果不在中断函数中处理，就要在进程函数中处理
           SX1276LoRa_Receive_Packet(false);
           printf("tx done\r\n");
        }
        else  if (*((tRFLRStates*)data) == RFLR_STATE_RX_RECEIVEING) 
        {
           etimer_set(&timer_rf, CLOCK_CONF_SECOND*2);                //超时时间还需要调整
           printf("rx start\r\n");
        } 
        else if (*((tRFLRStates*)data) == RFLR_STATE_RX_DONE) 
        {
           printf("rssi = %f  snr = %d ",SX1276LoRaGetPacketRssi(), SX1276LoRaGetPacketSnr());
         
          if (g_RF_LoRa.rf_DataBufferValid)
          {
             //etimer_stop(&timer_rf);                                 //此处如果不在中断函数中处理，就要在进程函数中处理
              hal_ToggleLED(TXD_LED);
              g_RF_LoRa.rf_DataBufferValid = false;
              hal_DebugDMATx(g_RF_LoRa.rf_DataBuffer, g_RF_LoRa.rf_RxPacketSize);
             
              //apl_ProcessRadioCmd();                                  //解析帧，传给应用层 
          }
          else
          {
              printf("CRC error\r\n");
          }
          SX1276LoRa_Receive_Packet(false);
        }
    }
    else if (ev == PROCESS_EVENT_TIMER)
    {
       if ((struct etimer *)data == &timer_rf)
       {
         if (SX1276LoRaGetRFState() == RFLR_STATE_TX_RUNNING)   
         {
            printf("tx time out\r\n");
         }
         if (SX1276LoRaGetRFState() ==  RFLR_STATE_RX_RECEIVEING)
         {
            printf("rx time out\r\n");
         }  
         hal_sRF_InitSPI();
         SX1276LoRa_Receive_Packet(false);
       }
    }
 }
 PROCESS_END();
}
#else
  
PROCESS_THREAD(hal_RF_process, ev, data)
{
  PROCESS_BEGIN();

  while(1)
  {
    PROCESS_WAIT_EVENT(); 

    if (ev == PROCESS_EVENT_MSG)
    {
        if (*((tRFStates*)data) == RF_STATE_TX_RUNNING)   
        {
            printf("tx start\r\n");
        }
        else if (*((tRFStates*)data) == RF_STATE_TX_DONE)  
        {
           printf("tx done\r\n");
           SX1276Fsk_recrive_Packet();
        }
        else  if (*((tRFStates*)data) == RF_STATE_RX_PREAMBLE) 
        {
            printf("rx start\r\n");
            etimer_set(&timer_rf, CLOCK_CONF_SECOND*3);
        }
        else if (*((tRFStates*)data) == RF_STATE_RX_DONE) 
        {
           printf("rx done\r\n");
           printf("rssi = %f\r\n",g_fsk.rssi);
           for (u8 i = 0; i < g_fsk.packetLenth; i++ )
           {
              printf("%d ",g_fsk.buffer[i]);
           }
           printf("\r\n");
           SX1276Fsk_recrive_Packet();
        }
    }
    else if (ev == PROCESS_EVENT_TIMER)
    {
         if ((struct etimer *)data == &timer_rf)
         {
           if (g_fsk.states == RF_STATE_TX_RUNNING)   
           {
              printf("tx time out\r\n");
           }
           else
           {
              hal_sRF_InitSPI();
              SX1276Fsk_recrive_Packet();
              printf("rx time out\r\n");
           }  
         }
       
