barrylw/lamp_project_slave/STM32F051_contiki_8M/APP/hal_radio.c
}
#endif
/*****************************************************************************
 Prototype    : hal_sRF_writeFIFO_DMA
 Description  : none
 Input        : u8 * pBuffer 指向开始发送的数组
                u8   length  实际发送的字节数   
 Output       : None
 Return Value : 
 Date         : 2014/3/21
 Author       : Barry
*****************************************************************************/
#ifdef SPI_DMA_FIFO
void hal_sRF_writeFIFO_DMA(u8 * pBuffer, u8 length)
{
  hal_sRF_Config(0,pBuffer,length);
}
  #endif
/******************************************************************************/
/*            STM32F10x Peripherals Interrupt Handlers                        */
/******************************************************************************/


/*****************************************************************************
 Prototype    : sRF_SPI_DMA_IRQHandler
 Description  :  
 Input        : void 
 Output       : None 
  History        :
  1.Date         :
    Author       : liwei
    Modification : Created function
*****************************************************************************/
#ifdef SPI_DMA_FIFO
void sRF_SPI_DMA_IRQHandler(void)
{
  if (DMA_GetITStatus(sRF_SPI_DMA_RX_COMPLETE) != RESET)
  {
    /* hal_sRF_InitSPI();初始化放在主循环中去 */
    RxEndProcess(true);
    
    /* Clear the DMA1 interrupt pending bits */
    DMA1->IFCR = sRF_SPI_DMA_RX_COMPLETE;
 
    /* Disable the selected DMA1_Channel2 */
    sRF_SPI_DMA_RX_Channel->CCR &= (u16)(~DMA_CCR_EN);
  }
  else if (DMA_GetITStatus(sRF_SPI_DMA_TX_COMPLETE) != RESET)
  {
     SX1276LoRaStartTransmit();
    
     /* Clear the DMA1 interrupt pending bits */
    DMA1->IFCR = sRF_SPI_DMA_TX_COMPLETE;
    
    /* Disable the selected DMA1_Channel3 */
    sRF_SPI_DMA_TX_Channel->CCR &= (u16)(~DMA_CCR_EN);
  }
  else if (DMA_GetITStatus(sRF_SPI_DMA_RX_ERROR) != RESET)
  {
     /* Disable sRF_SPI */
    sRF_SPI->CR1 &= (u16)~((u16)SPI_CR1_SPE);

    /* Clear the DMA1 interrupt pending bits */
    DMA1->IFCR = sRF_SPI_DMA_RX_ERROR;
    
    /* Disable the selected DMA1_Channel2 */
    sRF_SPI_DMA_RX_Channel->CCR &= (u16)(~DMA_CCR_EN);
  }
  else if (DMA_GetITStatus(sRF_SPI_DMA_TX_ERROR) != RESET)
  {
    /* Clear the DMA1 interrupt pending bits */
    DMA1->IFCR = sRF_SPI_DMA_TX_ERROR;
    
    /* Disable the selected DMA1_Channel3 */
    sRF_SPI_DMA_TX_Channel->CCR &= (u16)(~DMA_CCR_EN);
  }
  else
  {
    /* Clear the DMA1 interrupt pending bits */
    DMA1->IFCR = sRF_SPI_DMA_RX_HALF | sRF_SPI_DMA_TX_HALF;
  }
}
#endif
/*****************************************************************************
 Prototype    : hal_sRF_Transmit
 Description  : PHY send
 Input        : u8 *pBuffer  
                u8 length    
                u8 channel   
 Output       : None
 Return Value : 
 Calls        : 
 Called By    : 
 
  History        :
  1.Date         : 2014/10/29
    Author       : liwei
    Modification : Created function

*****************************************************************************/
void hal_sRF_Transmit(u8 *pBuffer, u8 length, u8 channel)
{
  SX1276LoRa_Send_Packet(pBuffer,length);
}

/*****************************************************************************
 Prototype    : hal_InitRF
 Description  : none
 Input        : void  
 Output       : None
 Return Value : 
 Date         : 2014/3/15
 Author       : Barry
*****************************************************************************/
void hal_InitRF(void)
{ 
  etimer_stop(&timer_rf);
  hal_sRF_InitSPI();
  GPIO_int_Config();
#ifdef USE_LORA_MODE
  SX1276_lora_init(true);
#else
  SX1276_lora_init(false);
#endif
  printf("reset RF\r\n");
}






/******************* (C) COPYRIGHT 2013 Robulink Technology Ltd.*****END OF FILE****/

